backend/app/foam_template/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (${U0} 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (${U0} 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (${U0} 0 0);
    }
    walls
    {
        type            slip;
    }
    model
    {
        type            noSlip;
    }
}

// ************************************************************************* //
