backend/app/foam_template/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform ${k0};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ${k0};
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ${k0};
        value           uniform ${k0};
    }
    walls
    {
        type            slip;
    }
    model
    {
        type            kqRWallFunction;
        value           uniform ${k0};
    }
}

// ************************************************************************* //
