backend/app/foam_template/0/omega
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform ${omega0};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ${omega0};
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ${omega0};
        value           uniform ${omega0};
    }
    walls
    {
        type            slip;
    }
    model
    {
        type            omegaWallFunction;
        value           uniform ${omega0};
    }
}

// ************************************************************************* //
