backend/app/foam_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         ${endTime};

deltaT          1;

writeControl    timeStep;

writeInterval   ${endTime};

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             no;

        patches         (model);
        rho             rhoInf;
        rhoInf          ${rho};
        magUInf         ${U0};
        lRef            ${lref};
        Aref            ${aref};
        CofR            (${cx} ${cy} ${cz});
        dragDir         (1 0 0);
        liftDir         (0 0 1);
        pitchAxis       (0 1 0);
    }

    solverInfo1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;
        log             no;
        fields          (U p k omega);
        writeResidualFields no;
    }

    surfaces1
    {
        type            surfaces;
        libs            (sampling);
        writeControl    onEnd;
        executeControl  onEnd;
        surfaceFormat   vtk;
        formatOptions
        {
            vtk
            {
                legacy      true;
                format      ascii;
            }
        }
        fields          (p U);
        interpolationScheme cellPoint;
        surfaces
        {
            modelSurface
            {
                type        patch;
                patches     (model);
                interpolate true;
            }
            sliceY
            {
                type        cuttingPlane;
                planeType   pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0);
                    normal  (0 1 0);
                }
                interpolate true;
            }
            sliceZ
            {
                type        cuttingPlane;
                planeType   pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0 0);
                    normal  (0 0 1);
                }
                interpolate true;
            }
        }
    }
}

// ************************************************************************* //
