backend/app/foam_template/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

model.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    subsetFeatures
    {
        nonManifoldEdges    no;
        openEdges           yes;
    }

    writeObj            no;
}

// ************************************************************************* //
